CommunityGD32Cores/gd32-pio-spl-package/gd32/spl/variants/gd32a50x/src/gd32a50x_mfcom.c
/*!
    \file    gd32a50x_mfcom.c
    \brief   MFCOM driver

    \version 2024-12-06, V1.4.0, firmware for GD32A50x
*/

/*
    Copyright (c) 2024, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#include "gd32a50x_mfcom.h"

/*!
    \brief      reset MFCOM
    \param[in]  none
    \param[out] none
    \retval     none
*/
void mfcom_deinit(void)
{
    /* reset MFCOM */
    rcu_periph_reset_enable(RCU_MFCOMRST);
    rcu_periph_reset_disable(RCU_MFCOMRST);
}

/*!
    \brief      software reset
    \param[in]  none
    \param[out] none
    \retval     none
*/
void mfcom_software_reset(void)
{
    MFCOM_CTL |= MFCOM_CTL_SWRSTEN;
    MFCOM_CTL &= ~MFCOM_CTL_SWRSTEN;
}


/*!
    \brief      enable MFCOM function
    \param[in]  none
    \param[out] none
    \retval     none
*/
void mfcom_enable(void)
{
    MFCOM_CTL |= MFCOM_CTL_MFCOMEN;
}

/*!
    \brief      disable MFCOM function
    \param[in]  none
    \param[out] none
    \retval     none
*/
void mfcom_disable(void)
{
    MFCOM_CTL &= ~MFCOM_CTL_MFCOMEN;
}

/*!
    \brief      initialize mfcom_timer_parameter_struct with the default values
    \param[in]  init_struct: the initialization timer parameter need
    \param[out] none
    \retval     none
*/
void mfcom_timer_struct_para_init(mfcom_timer_parameter_struct* init_struct)
{
    /* set the mfcom_timer_parameter_struct with the default values */
    init_struct->trigger_select = MFCOM_TIMER_TRGSEL_PIN0;
    init_struct->trigger_polarity = MFCOM_TIMER_TRGPOL_ACTIVE_HIGH;
    init_struct->pin_config = MFCOM_TIMER_PINCFG_INPUT;
    init_struct->pin_select = MFCOM_TIMER_PINSEL_PIN0;
    init_struct->pin_polarity = MFCOM_TIMER_PINPOL_ACTIVE_HIGH;
    init_struct->mode = MFCOM_TIMER_DISABLE;
    init_struct->output = MFCOM_TIMER_OUT_HIGH_EN;
    init_struct->decrement = MFCOM_TIMER_DEC_CLK_SHIFT_OUT;
    init_struct->reset = MFCOM_TIMER_RESET_NEVER;
    init_struct->disable = MFCOM_TIMER_DISMODE_NEVER;
    init_struct->enable = MFCOM_TIMER_ENMODE_ALWAYS;
    init_struct->stopbit = MFCOM_TIMER_STOPBIT_DISABLE;
    init_struct->startbit = MFCOM_TIMER_STARTBIT_DISABLE;
    init_struct->compare = 0U;
}

/*!
    \brief      initialize mfcom_shifter_parameter_struct with the default values
    \param[in]  init_struct: the initialization shifter parameter need
    \param[out] none
    \retval     none
*/
void mfcom_shifter_struct_para_init(mfcom_shifter_parameter_struct* init_struct)
{
    /* set the mfcom_shifter_parameter_struct with the default values */
    init_struct->timer_select = MFCOM_SHIFTER_TIMER0;
    init_struct->timer_polarity = MFCOM_SHIFTER_TIMPOL_ACTIVE_HIGH;
    init_struct->pin_config = MFCOM_SHIFTER_PINCFG_INPUT;
    init_struct->pin_select = MFCOM_SHIFTER_PINSEL_PIN0;
    init_struct->pin_polarity = MFCOM_SHIFTER_PINPOL_ACTIVE_HIGH;
    init_struct->mode = MFCOM_SHIFTER_DISABLE;
    init_struct->input_source = MFCOM_SHIFTER_INSRC_PIN;
    init_struct->stopbit = MFCOM_SHIFTER_STOPBIT_DISABLE;
    init_struct->startbit = MFCOM_SHIFTER_STARTBIT_DISABLE;
}

/*!
    \brief      initialize MFCOM timer parameter
    \param[in]  timer: MFCOM timer number
      \arg         MFCOM_TIMER_x(x=0..3)
	\param[in]  init_struct: the initialization timer parameter need
      \arg         trigger_select: MFCOM_TIMER_TRGSEL_PIN0       MFCOM_TIMER_TRGSEL_SHIFTER0 
                                MFCOM_TIMER_TRGSEL_PIN1          MFCOM_TIMER_TRGSEL_TIMER0   
                                MFCOM_TIMER_TRGSEL_PIN2          MFCOM_TIMER_TRGSEL_SHIFTER1 
                                MFCOM_TIMER_TRGSEL_PIN3          MFCOM_TIMER_TRGSEL_TIMER1   
                                MFCOM_TIMER_TRGSEL_PIN4          MFCOM_TIMER_TRGSEL_SHIFTER2 
                                MFCOM_TIMER_TRGSEL_PIN5          MFCOM_TIMER_TRGSEL_TIMER2   
                                MFCOM_TIMER_TRGSEL_PIN6          MFCOM_TIMER_TRGSEL_SHIFTER3 
                                MFCOM_TIMER_TRGSEL_PIN7          MFCOM_TIMER_TRGSEL_TIMER3   
                                MFCOM_TIMER_TRGSEL_EXTERNAL0     MFCOM_TIMER_TRGSEL_EXTERNAL1
                                MFCOM_TIMER_TRGSEL_EXTERNAL2     MFCOM_TIMER_TRGSEL_EXTERNAL3

                trigger_polarity: MFCOM_TIMER_TRGPOL_ACTIVE_HIGH
                                  MFCOM_TIMER_TRGPOL_ACTIVE_LOW 
                 
                pin_config: MFCOM_TIMER_PINCFG_INPUT    MFCOM_TIMER_PINCFG_OPENDRAIN
                            MFCOM_TIMER_PINCFG_BIDI     MFCOM_TIMER_PINCFG_OUTPUT

                pin_select: MFCOM_TIMER_PINSEL_PIN0      MFCOM_TIMER_PINSEL_PIN1
                            MFCOM_TIMER_PINSEL_PIN2      MFCOM_TIMER_PINSEL_PIN3
                            MFCOM_TIMER_PINSEL_PIN4      MFCOM_TIMER_PINSEL_PIN5
                            MFCOM_TIMER_PINSEL_PIN6      MFCOM_TIMER_PINSEL_PIN7

